InformationRegisters/Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>Настройки</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИденификаторБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>WSDL_УдаленноеПодключение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>WSDL_Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>WSDL_Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>WSDL_УдаленноеПодключениеРезерв</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутьККонфигурационномуФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутьКФайламЛоговТЖ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормироватьПочтовыеФайлы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутьКФайламПочтовыхВложений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭлектроннаяПочтаСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПотоковДляОбработкиЛогов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗагружатьЛогиВПамятьДляОбработки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОперативныйРежимПолученияИнформацииОЗапросах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДлительностьЗапросовПорог1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДлительностьЗапросовПорог2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДлительностьЗапросовПорог3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодХраненияЛоговТехнологическогоЖурнала</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодОбработкиПороговДлительности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбработкаПорговДлительности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВключатьПланыЗапросов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСУБД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипСУБД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыключитьМониторингЗапросы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыключитьМониторингОшибки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияПлатформы1С</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВерсияПлатформы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерРелиза</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерКлиентскойЧасти</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОперативныйРежимПолученияИнформацииОбОшибках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользуетсяОфлайнМониторинг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкаОфлайнМониторинга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиОфлайнМониторинга</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>WSDL_Status_УдаленноеПодключение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>WSDL_Status_УдаленноеПодключениеРезерв</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>WSDL_Status_Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>WSDL_Status_Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипСУБД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ТипСУБД</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>SQLServer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PostgreSQL</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Файловая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Oracle</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DB2</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/Настройки/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриИзмененииРежимаНастроек();
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	ФлагПочты = Запись.ФормироватьПочтовыеФайлы;
	ФлагОперативнойОбработкиЛогов = Запись.ОперативныйРежимПолученияИнформацииОЗапросах;
	
	Элементы.ЭлектроннаяПочтаСервиса.Видимость = ФлагПочты;
	Элементы.ПутьКФайламПочтовыхВложений.Видимость = ФлагПочты;
	Элементы.WSDL_УдаленноеПодключение.Видимость = НЕ ФлагПочты;
	Элементы.WSDL_Пользователь.Видимость = НЕ ФлагПочты;
	Элементы.WSDL_Пароль.Видимость = НЕ ФлагПочты;
	
	
	Элементы.ДлительностьЗапросовПорог2.Видимость = НЕ ФлагОперативнойОбработкиЛогов;
	Элементы.ДлительностьЗапросовПорог3.Видимость = НЕ ФлагОперативнойОбработкиЛогов;
	Элементы.МетодОбработкиПороговДлительности.Видимость = НЕ ФлагОперативнойОбработкиЛогов;
	
	Элементы.ВключатьПланыЗапросов.Доступность = МожноСобиратьПланыЗапросов(Запись.ТипСУБД); 
	Элементы.ВключатьПланыЗапросов1.Доступность = МожноСобиратьПланыЗапросов(Запись.ТипСУБД); 
	
КонецПроцедуры

&НаКлиенте
Процедура ФормироватьПочтовыеФайлыПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ОперативныйРежимПолученияИнформацииОЗапросахПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПроверкаВключенияМониторинга();
	
	Оповестить("ЗаписьНастроек");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПоискПутей(Команда)
	
	ВыполнитьПоискПутей3НаСервере();
		
	Если Элементы.ПутьККонфигурационномуФайлу.СписокВыбора.Количество() > 0 
		и НЕ КаталогСуществуетНаСервере(Запись.ПутьККонфигурационномуФайлу) Тогда
		Запись.ПутьККонфигурационномуФайлу = Элементы.ПутьККонфигурационномуФайлу.СписокВыбора[0].Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция КаталогСуществуетНаСервере(Путь)
	
	Результат = Ложь;
	
	Попытка
		Каталог = Новый Файл(Путь);
		Если Каталог.Существует() Тогда
			Результат = Истина;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ВыполнитьПоискПутейНаСервере()
	
	Элементы.ПутьККонфигурационномуФайлу.СписокВыбора.Очистить();
	
	Локатор = Новый COMОбъект("WbemScripting.SWbemLocator");
	
	// подключаемся к службе WMI:
	СлужбаWMI = Локатор.ConnectServer();
	// метод InstancesOf  предназначен для получения коллекции экземпляров указанного в скобках класса:
	Программы = СлужбаWMI.InstancesOf("Win32_Product");
	
	СписокПутей = Новый Массив;
	
	Для Каждого Программа из Программы Цикл
		
		Название = "" + Программа.Name;
		Если Найти(Название, "1C:Предприятие") = 0 Тогда
			Продолжить;
		КонецЕсли;
		ПутьУстановки = Программа.InstallLocation; 
		// Путь - Строка вида: "C:\Program Files (x86)\1cv8\8.3.5.1146\"
		
		ФайлРАгент = Новый Файл(ПутьУстановки + "bin\ragent.exe");
		Если Не ФайлРАгент.Существует() Тогда
			Продолжить;
		КонецЕсли;
		
		// Поднимемся на уровень вверх
		ДлинаСтроки = СтрДлина(ПутьУстановки);
		поз = 0;
		Для к = 1 по ДлинаСтроки Цикл
			Если сред(ПутьУстановки,ДлинаСтроки-к,1) = "\" Тогда
				поз = ДлинаСтроки-к;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если поз > 0 Тогда
			ОбщийКаталог1С = Лев(ПутьУстановки,ДлинаСтроки-к);
		Иначе
			Продолжить;
		КонецЕсли;
		
		КаталогКонф = ОбщийКаталог1С + "Conf";
		Каталог = Новый Файл(КаталогКонф);
		Если Каталог.Существует() Тогда
			Если Элементы.ПутьККонфигурационномуФайлу.СписокВыбора.НайтиПоЗначению(КаталогКонф) = Неопределено Тогда
				Элементы.ПутьККонфигурационномуФайлу.СписокВыбора.Добавить(КаталогКонф);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Элементы.ПутьККонфигурационномуФайлу.СписокВыбора.Количество() = 0 Тогда
		Сообщить("Путь к конфигурационному файлу на сервере не найден");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустой() Тогда
		
		КаталогФайловТЖ = "c:\Users\Public\Documents\";
		Каталог = Новый Файл(КаталогФайловТЖ);
		Если Каталог.Существует() Тогда
			Запись.ПутьКФайламЛоговТЖ = КаталогФайловТЖ + "1C_Log";
		КонецЕсли;
		
		ВыполнитьПоискПутей3НаСервере();
		Если Элементы.ПутьККонфигурационномуФайлу.СписокВыбора.Количество() > 0 Тогда
			Запись.ПутьККонфигурационномуФайлу = Элементы.ПутьККонфигурационномуФайлу.СписокВыбора[0].Значение;
		КонецЕсли;
		
	КонецЕсли;
	//ПутьКФайламТЖ = КаталогДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура РасширенныеНастройки(Команда)
	РежимРасширенныхНастроек = НЕ РежимРасширенныхНастроек;
	ПриИзмененииРежимаНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРежимаНастроек()
	
	Элементы.ФормаРасширенныеНастройки.Пометка = РежимРасширенныхНастроек;
	
	Элементы.ГруппаСтраницы.ОтображениеСтраниц = ?(РежимРасширенныхНастроек, ОтображениеСтраницФормы.ЗакладкиСверху, ОтображениеСтраницФормы.Нет);
	
	Элементы.ГруппаУпрощенныеНастройки.Видимость = Не РежимРасширенныхНастроек;
	Элементы.ГруппаОбщиеНастройки.Видимость = РежимРасширенныхНастроек;
	Элементы.ГруппаАнализДолгихЗапросов.Видимость = РежимРасширенныхНастроек;
	Элементы.ГруппаСобытияТЖ.Видимость = РежимРасширенныхНастроек;
	Элементы.ПараметрыПодключенияКВэбСервисам.Видимость = РежимРасширенныхНастроек;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПоискПутей3НаСервере()
	
	СписокПутей = Новый Массив;
	
	КаталогЗапуска = КаталогПрограммы();
	
	КонфКФГ = Новый Файл(КаталогЗапуска + "conf\conf.cfg");
	Если НЕ КонфКФГ.Существует() Тогда
		Возврат;
	КонецЕсли;
	
	Текст = Новый ТекстовыйДокумент;
	Текст.Прочитать(КаталогЗапуска + "conf\conf.cfg");
	
	ПутьЛогКФГ = КонфКФГ;
	Для к = 1 По Текст.КоличествоСтрок() Цикл
		ОчереднаяСтрока = СокрЛП(Текст.ПолучитьСтроку(к));
		Если ВРег(Лев(ОчереднаяСтрока,12)) = ВРег("ConfLocation") Тогда
			поз = Найти(ОчереднаяСтрока,"=");
			ПутьЛогКФГ = СокрЛП(Сред(ОчереднаяСтрока,поз+1));
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	СписокПутей.Добавить(ПутьЛогКФГ);
	
	Элементы.ПутьККонфигурационномуФайлу.СписокВыбора.ЗагрузитьЗначения(СписокПутей);	
	Элементы.ПутьККонфигурационномуФайлу1.СписокВыбора.ЗагрузитьЗначения(СписокПутей);	

	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайламЛоговТЖНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВыбратьКаталогЛоговТЖ();	
КонецПроцедуры

&наКлиенте
Процедура ВыбратьКаталогЛоговТЖ()
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораФайла.Каталог = Запись.ПутьКФайламЛоговТЖ;
	Если ДиалогВыбораФайла.Выбрать() Тогда
		Запись.ПутьКФайламЛоговТЖ = ДиалогВыбораФайла.Каталог;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПутьККонфигурационномуФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВыбратьКаталогКонфигурационногоФайлаТЖ();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКаталогКонфигурационногоФайлаТЖ()
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораФайла.Каталог = Запись.ПутьККонфигурационномуФайлу;
	Если ДиалогВыбораФайла.Выбрать() Тогда
		Запись.ПутьККонфигурационномуФайлу = ДиалогВыбораФайла.Каталог;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьЗарегистрироватьИдентификатор(Команда)
	
	АдресЭлектроннойПочты = "";
	ВвестиСтроку(АдресЭлектроннойПочты, "Укажите адрес электронной почты. На указанный адрес будет отправлен пароль вашей учетной записи в сервисах Gilev.ru");

	Если НЕ ЗначениеЗаполнено(АдресЭлектроннойПочты) Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьЗапросРегистрации(АдресЭлектроннойПочты);
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗапросРегистрации(АдресЭлектроннойПочты)
	
	Попытка
		WS_Определение = Новый WSОпределения("http://localhost/web_service_GetID_ignatiev/ws/GetIDGilevRu.1cws?wsdl", "", "");
	Исключение
		Возврат;
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	Прокси = Новый WSПрокси(WS_Определение, 
	"www.gilev.ru",
	"GetIDGilevRu",
	"GetIDGilevRuSoap");
	
	Идентификатор = Запись.ИденификаторБазы;
	//EMail = "q@q.ru";
	Отказ = Ложь;
	Сообщение = "";
	
	Прокси.GetIDGilevRu(Идентификатор,АдресЭлектроннойПочты,Отказ,Сообщение);
	
	Если НЕ Отказ Тогда
		Если НЕ ЗначениеЗаполнено(Запись.ИденификаторБазы) Тогда
			Запись.ИденификаторБазы = Идентификатор;
		КонецЕсли;
	КонецЕсли;
	
	Сообщить(Сообщение);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипСУБДПриИзменении(Элемент)
	Если (НЕ МожноСобиратьПланыЗапросов(Элемент.ВыделенныйТекст)) И Запись.ВключатьПланыЗапросов Тогда
		Запись.ВключатьПланыЗапросов=Ложь;
	КонецЕсли;
	Элементы.ВключатьПланыЗапросов.Доступность = МожноСобиратьПланыЗапросов(Запись.ТипСУБД); 
	Элементы.ВключатьПланыЗапросов1.Доступность = МожноСобиратьПланыЗапросов(Запись.ТипСУБД); 
КонецПроцедуры

&НаСервере
Функция МожноСобиратьПланыЗапросов(Значение)
	Если (СокрЛП(Значение) = СокрЛП(Перечисления.ТипСУБД.DB2) ИЛИ
		СокрЛП(Значение) = СокрЛП(Перечисления.ТипСУБД.Oracle)) Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
КонецФункции
